package main

import "fmt"

func main() {
	/*
		В Go код после case выполняется до следующего case, и нет нужды каждый case-блок заканчивать ключевым словом break
		(данная особенность добавлена в язык специально, чтобы уменьшить количество ошибок в switch-блоках). Если в текущем
		case написать fallthrough, то тело следующего case выполнится вне зависимости от того истинно ли его (следующего case)
		условие:
	*/
	v := 42
	switch v {
	case 100:
		fmt.Println(100)
		fallthrough
	case 42:
		fmt.Println(42)
		fallthrough
	case 1:
		fmt.Println(1)
		fallthrough
	default:
		fmt.Println("default")
	}
	// Вывод:
	// 42
	// 1
	// default

	// ************************************************************************

	/*
		Существует специальная форма switch, допускающая использование произвольных условий в каждом case-блоке:
	*/
	var c uint32
	fmt.Scan(&c)
	switch {
	case 1 <= c && c <= 9:
		fmt.Println("от 1 до 9")
	case 100 <= c && c <= 250:
		fmt.Println("от 100 до 250")
	case 1000 <= c && c <= 6000:
		fmt.Println("от 1000 до 6000")
	}
	/*
		То есть, сразу после switch "переключатель" не нужен, а после каждого case идет выражение с произвольным условием.
	*/
}
